# Handle Missing Data

In [24]:
import pandas as pd

data = pd.read_csv("employess.csv")
print(data)

    EEID      Name gender   salary
0  EMP01      ravi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [6]:
#  to find null values 
# print(data.isnull())
# to find null value in form of total 
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [8]:
#  to drop the duplicate values 
print(data.dropna())
# But thats not the right approach

    EEID   Name gender   salary
1  EMP02  rohit      M  25000.0
3  EMP01   ravi      F  20000.0
6  EMP02  rohit      M  25000.0

In [11]:
# replace values of null to 30000
import numpy as np 
print(data.replace(np.nan,30000))

#  now thats a problem because our gender and name is 30000

    EEID      Name gender   salary
0  EMP01      ravi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  30000  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05     30000      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [18]:
#  now its better approach 

data["salary"] = data["salary"].replace(np.nan,30000)
print(data)

    EEID      Name gender   salary
0  EMP01      ravi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [22]:
# find mean of column salary (thats not eefect on our data)
print(data["salary"].mean())
# now replace  mean amount to null values
data["salary"] = data["salary"].replace(np.nan,24400)
print(data)

24400.0
    EEID      Name gender   salary
0  EMP01      ravi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [23]:
print(data["salary"].mean())

24400.0

In [30]:
# other method is backward fill and forward fill 
print(data)
print(data.fillna(method="bfill"))
print(data.fillna(method="ffill"))

    EEID      Name gender   salary
0  EMP01      ravi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0
    EEID      Name gender   salary
0  EMP01      ravi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0
    EEID      Name gender   salary
0  EMP01      ravi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05      ravi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\Ravi Kumar\AppData\Local\Temp\ipykernel_12252\699732172.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))
C:\Users\Ravi Kumar\AppData\Local\Temp\ipykernel_12252\699732172.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill"))

In [31]:
#  to fill a random value 
print(data.fillna("hello"))

    EEID      Name gender   salary
0  EMP01      ravi      F    hello
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  hello  27000.0
3  EMP01      ravi      F  20000.0
4  EMP05     hello      M  25000.0
5  EMP06     rohit      M    hello
6  EMP02     rohit      M  25000.0